Some pinned objects were deleted because their parent or host object was deleted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PinnedObjectHostDeleted { get; }
  Visual Basic
Public Shared ReadOnly Property PinnedObjectHostDeleted As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PinnedObjectHostDeleted {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace